{
  "</tool_call>": 151658,
  "<tool_call>": 151657,
  "<|beginoftext|>": 151665,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|mask|>": 151666,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652,
  "[#Branch1]": 151667,
  "[#Branch2]": 151668,
  "[#C]": 151669,
  "[#N+1]": 151670,
  "[#N]": 151671,
  "[-/Ring1]": 151672,
  "[-/Ring2]": 151673,
  "[-\\Ring1]": 151674,
  "[/Br]": 151675,
  "[/C@@H1]": 151676,
  "[/C@@]": 151677,
  "[/C@H1]": 151678,
  "[/C@]": 151679,
  "[/C]": 151680,
  "[/Cl]": 151681,
  "[/F]": 151682,
  "[/N+1]": 151683,
  "[/N-1]": 151684,
  "[/NH1+1]": 151685,
  "[/NH1-1]": 151686,
  "[/NH1]": 151687,
  "[/NH2+1]": 151688,
  "[/N]": 151689,
  "[/O+1]": 151690,
  "[/O-1]": 151691,
  "[/O]": 151692,
  "[/S-1]": 151693,
  "[/S@]": 151694,
  "[/S]": 151695,
  "[=Branch1]": 151696,
  "[=Branch2]": 151697,
  "[=C]": 151698,
  "[=N+1]": 151699,
  "[=N-1]": 151700,
  "[=NH1+1]": 151701,
  "[=NH2+1]": 151702,
  "[=N]": 151703,
  "[=O+1]": 151704,
  "[=OH1+1]": 151705,
  "[=O]": 151706,
  "[=P@@]": 151707,
  "[=P@]": 151708,
  "[=PH2]": 151709,
  "[=P]": 151710,
  "[=Ring1]": 151711,
  "[=Ring2]": 151712,
  "[=S+1]": 151713,
  "[=S@@]": 151714,
  "[=S@]": 151715,
  "[=SH1+1]": 151716,
  "[=S]": 151717,
  "[Br]": 151718,
  "[Branch1]": 151719,
  "[Branch2]": 151720,
  "[C@@H1]": 151721,
  "[C@@]": 151722,
  "[C@H1]": 151723,
  "[C@]": 151724,
  "[CH1-1]": 151725,
  "[CH2-1]": 151726,
  "[C]": 151727,
  "[Cl]": 151728,
  "[F]": 151729,
  "[I]": 151730,
  "[N+1]": 151731,
  "[N-1]": 151732,
  "[NH1+1]": 151733,
  "[NH1-1]": 151734,
  "[NH1]": 151735,
  "[NH2+1]": 151736,
  "[NH3+1]": 151737,
  "[N]": 151738,
  "[O-1]": 151739,
  "[O]": 151740,
  "[P+1]": 151741,
  "[P@@H1]": 151742,
  "[P@@]": 151743,
  "[P@]": 151744,
  "[PH1+1]": 151745,
  "[PH1]": 151746,
  "[P]": 151747,
  "[Ring1]": 151748,
  "[Ring2]": 151749,
  "[S+1]": 151750,
  "[S-1]": 151751,
  "[S@@+1]": 151752,
  "[S@@]": 151753,
  "[S@]": 151754,
  "[S]": 151755,
  "[\\Br]": 151756,
  "[\\C@@H1]": 151757,
  "[\\C@H1]": 151758,
  "[\\C]": 151759,
  "[\\Cl]": 151760,
  "[\\F]": 151761,
  "[\\I]": 151762,
  "[\\N+1]": 151763,
  "[\\N-1]": 151764,
  "[\\NH1+1]": 151765,
  "[\\NH1]": 151766,
  "[\\NH2+1]": 151767,
  "[\\N]": 151768,
  "[\\O-1]": 151769,
  "[\\O]": 151770,
  "[\\S-1]": 151771,
  "[\\S@]": 151772,
  "[\\S]": 151773
}
